analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/usbhs_regs.h
#define MXC_F_USBHS_INTRUSBEN_RESET_INT_EN_POS         2 /**< INTRUSBEN_RESET_INT_EN Position */
#define MXC_F_USBHS_INTRUSBEN_RESET_INT_EN             ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSBEN_RESET_INT_EN_POS)) /**< INTRUSBEN_RESET_INT_EN Mask */

#define MXC_F_USBHS_INTRUSBEN_RESUME_INT_EN_POS        1 /**< INTRUSBEN_RESUME_INT_EN Position */
#define MXC_F_USBHS_INTRUSBEN_RESUME_INT_EN            ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSBEN_RESUME_INT_EN_POS)) /**< INTRUSBEN_RESUME_INT_EN Mask */

#define MXC_F_USBHS_INTRUSBEN_SUSPEND_INT_EN_POS       0 /**< INTRUSBEN_SUSPEND_INT_EN Position */
#define MXC_F_USBHS_INTRUSBEN_SUSPEND_INT_EN           ((uint8_t)(0x1UL << MXC_F_USBHS_INTRUSBEN_SUSPEND_INT_EN_POS)) /**< INTRUSBEN_SUSPEND_INT_EN Mask */

/**@} end of group USBHS_INTRUSBEN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FRAME USBHS_FRAME
 * @brief    Frame number.
 * @{
 */
#define MXC_F_USBHS_FRAME_FRAMENUM_POS                 0 /**< FRAME_FRAMENUM Position */
#define MXC_F_USBHS_FRAME_FRAMENUM                     ((uint16_t)(0x7FFUL << MXC_F_USBHS_FRAME_FRAMENUM_POS)) /**< FRAME_FRAMENUM Mask */

/**@} end of group USBHS_FRAME_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INDEX USBHS_INDEX
 * @brief    Index for banked registers.
 * @{
 */
#define MXC_F_USBHS_INDEX_INDEX_POS                    0 /**< INDEX_INDEX Position */
#define MXC_F_USBHS_INDEX_INDEX                        ((uint8_t)(0xFUL << MXC_F_USBHS_INDEX_INDEX_POS)) /**< INDEX_INDEX Mask */

/**@} end of group USBHS_INDEX_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_TESTMODE USBHS_TESTMODE
 * @brief    USB 2.0 test mode enable register.
 * @{
 */
#define MXC_F_USBHS_TESTMODE_FORCE_FS_POS              5 /**< TESTMODE_FORCE_FS Position */
#define MXC_F_USBHS_TESTMODE_FORCE_FS                  ((uint8_t)(0x1UL << MXC_F_USBHS_TESTMODE_FORCE_FS_POS)) /**< TESTMODE_FORCE_FS Mask */

#define MXC_F_USBHS_TESTMODE_FORCE_HS_POS              4 /**< TESTMODE_FORCE_HS Position */
#define MXC_F_USBHS_TESTMODE_FORCE_HS                  ((uint8_t)(0x1UL << MXC_F_USBHS_TESTMODE_FORCE_HS_POS)) /**< TESTMODE_FORCE_HS Mask */

#define MXC_F_USBHS_TESTMODE_TEST_PKT_POS              3 /**< TESTMODE_TEST_PKT Position */
#define MXC_F_USBHS_TESTMODE_TEST_PKT                  ((uint8_t)(0x1UL << MXC_F_USBHS_TESTMODE_TEST_PKT_POS)) /**< TESTMODE_TEST_PKT Mask */

#define MXC_F_USBHS_TESTMODE_TEST_K_POS                2 /**< TESTMODE_TEST_K Position */
#define MXC_F_USBHS_TESTMODE_TEST_K                    ((uint8_t)(0x1UL << MXC_F_USBHS_TESTMODE_TEST_K_POS)) /**< TESTMODE_TEST_K Mask */

#define MXC_F_USBHS_TESTMODE_TEST_J_POS                1 /**< TESTMODE_TEST_J Position */
#define MXC_F_USBHS_TESTMODE_TEST_J                    ((uint8_t)(0x1UL << MXC_F_USBHS_TESTMODE_TEST_J_POS)) /**< TESTMODE_TEST_J Mask */

#define MXC_F_USBHS_TESTMODE_TEST_SE0_NAK_POS          0 /**< TESTMODE_TEST_SE0_NAK Position */
#define MXC_F_USBHS_TESTMODE_TEST_SE0_NAK              ((uint8_t)(0x1UL << MXC_F_USBHS_TESTMODE_TEST_SE0_NAK_POS)) /**< TESTMODE_TEST_SE0_NAK Mask */

/**@} end of group USBHS_TESTMODE_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INMAXP USBHS_INMAXP
 * @brief    Maximum packet size for INx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_INMAXP_MAXPACKETSIZE_POS           0 /**< INMAXP_MAXPACKETSIZE Position */
#define MXC_F_USBHS_INMAXP_MAXPACKETSIZE               ((uint16_t)(0x7FFUL << MXC_F_USBHS_INMAXP_MAXPACKETSIZE_POS)) /**< INMAXP_MAXPACKETSIZE Mask */

#define MXC_F_USBHS_INMAXP_NUMPACKMINUS1_POS           11 /**< INMAXP_NUMPACKMINUS1 Position */
#define MXC_F_USBHS_INMAXP_NUMPACKMINUS1               ((uint16_t)(0x1FUL << MXC_F_USBHS_INMAXP_NUMPACKMINUS1_POS)) /**< INMAXP_NUMPACKMINUS1 Mask */

/**@} end of group USBHS_INMAXP_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_CSR0 USBHS_CSR0
 * @brief    Control status register for EP 0 (when INDEX == 0).
 * @{
 */
#define MXC_F_USBHS_CSR0_SERV_SETUP_END_POS            7 /**< CSR0_SERV_SETUP_END Position */
#define MXC_F_USBHS_CSR0_SERV_SETUP_END                ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_SERV_SETUP_END_POS)) /**< CSR0_SERV_SETUP_END Mask */

#define MXC_F_USBHS_CSR0_SERV_OUTPKTRDY_POS            6 /**< CSR0_SERV_OUTPKTRDY Position */
#define MXC_F_USBHS_CSR0_SERV_OUTPKTRDY                ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_SERV_OUTPKTRDY_POS)) /**< CSR0_SERV_OUTPKTRDY Mask */

#define MXC_F_USBHS_CSR0_SEND_STALL_POS                5 /**< CSR0_SEND_STALL Position */
#define MXC_F_USBHS_CSR0_SEND_STALL                    ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_SEND_STALL_POS)) /**< CSR0_SEND_STALL Mask */

#define MXC_F_USBHS_CSR0_SETUP_END_POS                 4 /**< CSR0_SETUP_END Position */
#define MXC_F_USBHS_CSR0_SETUP_END                     ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_SETUP_END_POS)) /**< CSR0_SETUP_END Mask */

#define MXC_F_USBHS_CSR0_DATA_END_POS                  3 /**< CSR0_DATA_END Position */
#define MXC_F_USBHS_CSR0_DATA_END                      ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_DATA_END_POS)) /**< CSR0_DATA_END Mask */

#define MXC_F_USBHS_CSR0_SENT_STALL_POS                2 /**< CSR0_SENT_STALL Position */
#define MXC_F_USBHS_CSR0_SENT_STALL                    ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_SENT_STALL_POS)) /**< CSR0_SENT_STALL Mask */

#define MXC_F_USBHS_CSR0_INPKTRDY_POS                  1 /**< CSR0_INPKTRDY Position */
#define MXC_F_USBHS_CSR0_INPKTRDY                      ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_INPKTRDY_POS)) /**< CSR0_INPKTRDY Mask */

#define MXC_F_USBHS_CSR0_OUTPKTRDY_POS                 0 /**< CSR0_OUTPKTRDY Position */
#define MXC_F_USBHS_CSR0_OUTPKTRDY                     ((uint8_t)(0x1UL << MXC_F_USBHS_CSR0_OUTPKTRDY_POS)) /**< CSR0_OUTPKTRDY Mask */

/**@} end of group USBHS_CSR0_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_INCSRL USBHS_INCSRL
 * @brief    Control status lower register for INx endpoint (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_INCSRL_INCOMPTX_POS                7 /**< INCSRL_INCOMPTX Position */
#define MXC_F_USBHS_INCSRL_INCOMPTX                    ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_INCOMPTX_POS)) /**< INCSRL_INCOMPTX Mask */

#define MXC_F_USBHS_INCSRL_CLRDATATOG_POS              6 /**< INCSRL_CLRDATATOG Position */
#define MXC_F_USBHS_INCSRL_CLRDATATOG                  ((uint8_t)(0x1UL << MXC_F_USBHS_INCSRL_CLRDATATOG_POS)) /**< INCSRL_CLRDATATOG Mask */

