analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/usbhs_regs.h
#define MXC_F_USBHS_OUTCSRU_DPKTBUFDIS_POS             1 /**< OUTCSRU_DPKTBUFDIS Position */
#define MXC_F_USBHS_OUTCSRU_DPKTBUFDIS                 ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_DPKTBUFDIS_POS)) /**< OUTCSRU_DPKTBUFDIS Mask */

#define MXC_F_USBHS_OUTCSRU_INCOMPRX_POS               0 /**< OUTCSRU_INCOMPRX Position */
#define MXC_F_USBHS_OUTCSRU_INCOMPRX                   ((uint8_t)(0x1UL << MXC_F_USBHS_OUTCSRU_INCOMPRX_POS)) /**< OUTCSRU_INCOMPRX Mask */

/**@} end of group USBHS_OUTCSRU_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_COUNT0 USBHS_COUNT0
 * @brief    Number of received bytes in EP 0 FIFO (INDEX == 0).
 * @{
 */
#define MXC_F_USBHS_COUNT0_COUNT0_POS                  0 /**< COUNT0_COUNT0 Position */
#define MXC_F_USBHS_COUNT0_COUNT0                      ((uint16_t)(0x7FUL << MXC_F_USBHS_COUNT0_COUNT0_POS)) /**< COUNT0_COUNT0 Mask */

/**@} end of group USBHS_COUNT0_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_OUTCOUNT USBHS_OUTCOUNT
 * @brief    Number of received bytes in OUT EPx FIFO (x == INDEX).
 * @{
 */
#define MXC_F_USBHS_OUTCOUNT_OUTCOUNT_POS              0 /**< OUTCOUNT_OUTCOUNT Position */
#define MXC_F_USBHS_OUTCOUNT_OUTCOUNT                  ((uint16_t)(0x1FFFUL << MXC_F_USBHS_OUTCOUNT_OUTCOUNT_POS)) /**< OUTCOUNT_OUTCOUNT Mask */

/**@} end of group USBHS_OUTCOUNT_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO0 USBHS_FIFO0
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO0_USBHS_FIFO0_POS              0 /**< FIFO0_USBHS_FIFO0 Position */
#define MXC_F_USBHS_FIFO0_USBHS_FIFO0                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO0_USBHS_FIFO0_POS)) /**< FIFO0_USBHS_FIFO0 Mask */

/**@} end of group USBHS_FIFO0_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO1 USBHS_FIFO1
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO1_USBHS_FIFO1_POS              0 /**< FIFO1_USBHS_FIFO1 Position */
#define MXC_F_USBHS_FIFO1_USBHS_FIFO1                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO1_USBHS_FIFO1_POS)) /**< FIFO1_USBHS_FIFO1 Mask */

/**@} end of group USBHS_FIFO1_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO2 USBHS_FIFO2
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO2_USBHS_FIFO2_POS              0 /**< FIFO2_USBHS_FIFO2 Position */
#define MXC_F_USBHS_FIFO2_USBHS_FIFO2                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO2_USBHS_FIFO2_POS)) /**< FIFO2_USBHS_FIFO2 Mask */

/**@} end of group USBHS_FIFO2_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO3 USBHS_FIFO3
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO3_USBHS_FIFO3_POS              0 /**< FIFO3_USBHS_FIFO3 Position */
#define MXC_F_USBHS_FIFO3_USBHS_FIFO3                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO3_USBHS_FIFO3_POS)) /**< FIFO3_USBHS_FIFO3 Mask */

/**@} end of group USBHS_FIFO3_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO4 USBHS_FIFO4
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO4_USBHS_FIFO4_POS              0 /**< FIFO4_USBHS_FIFO4 Position */
#define MXC_F_USBHS_FIFO4_USBHS_FIFO4                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO4_USBHS_FIFO4_POS)) /**< FIFO4_USBHS_FIFO4 Mask */

/**@} end of group USBHS_FIFO4_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO5 USBHS_FIFO5
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO5_USBHS_FIFO5_POS              0 /**< FIFO5_USBHS_FIFO5 Position */
#define MXC_F_USBHS_FIFO5_USBHS_FIFO5                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO5_USBHS_FIFO5_POS)) /**< FIFO5_USBHS_FIFO5 Mask */

/**@} end of group USBHS_FIFO5_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO6 USBHS_FIFO6
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO6_USBHS_FIFO6_POS              0 /**< FIFO6_USBHS_FIFO6 Position */
#define MXC_F_USBHS_FIFO6_USBHS_FIFO6                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO6_USBHS_FIFO6_POS)) /**< FIFO6_USBHS_FIFO6 Mask */

/**@} end of group USBHS_FIFO6_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO7 USBHS_FIFO7
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO7_USBHS_FIFO7_POS              0 /**< FIFO7_USBHS_FIFO7 Position */
#define MXC_F_USBHS_FIFO7_USBHS_FIFO7                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO7_USBHS_FIFO7_POS)) /**< FIFO7_USBHS_FIFO7 Mask */

/**@} end of group USBHS_FIFO7_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO8 USBHS_FIFO8
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO8_USBHS_FIFO8_POS              0 /**< FIFO8_USBHS_FIFO8 Position */
#define MXC_F_USBHS_FIFO8_USBHS_FIFO8                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO8_USBHS_FIFO8_POS)) /**< FIFO8_USBHS_FIFO8 Mask */

/**@} end of group USBHS_FIFO8_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO9 USBHS_FIFO9
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO9_USBHS_FIFO9_POS              0 /**< FIFO9_USBHS_FIFO9 Position */
#define MXC_F_USBHS_FIFO9_USBHS_FIFO9                  ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO9_USBHS_FIFO9_POS)) /**< FIFO9_USBHS_FIFO9 Mask */

/**@} end of group USBHS_FIFO9_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO10 USBHS_FIFO10
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO10_USBHS_FIFO10_POS            0 /**< FIFO10_USBHS_FIFO10 Position */
#define MXC_F_USBHS_FIFO10_USBHS_FIFO10                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO10_USBHS_FIFO10_POS)) /**< FIFO10_USBHS_FIFO10 Mask */

/**@} end of group USBHS_FIFO10_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO11 USBHS_FIFO11
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO11_USBHS_FIFO11_POS            0 /**< FIFO11_USBHS_FIFO11 Position */
#define MXC_F_USBHS_FIFO11_USBHS_FIFO11                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO11_USBHS_FIFO11_POS)) /**< FIFO11_USBHS_FIFO11 Mask */

/**@} end of group USBHS_FIFO11_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO12 USBHS_FIFO12
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO12_USBHS_FIFO12_POS            0 /**< FIFO12_USBHS_FIFO12 Position */
#define MXC_F_USBHS_FIFO12_USBHS_FIFO12                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO12_USBHS_FIFO12_POS)) /**< FIFO12_USBHS_FIFO12 Mask */

