analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/usbhs_regs.h
/**@} end of group USBHS_FIFO12_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO13 USBHS_FIFO13
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO13_USBHS_FIFO13_POS            0 /**< FIFO13_USBHS_FIFO13 Position */
#define MXC_F_USBHS_FIFO13_USBHS_FIFO13                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO13_USBHS_FIFO13_POS)) /**< FIFO13_USBHS_FIFO13 Mask */

/**@} end of group USBHS_FIFO13_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO14 USBHS_FIFO14
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO14_USBHS_FIFO14_POS            0 /**< FIFO14_USBHS_FIFO14 Position */
#define MXC_F_USBHS_FIFO14_USBHS_FIFO14                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO14_USBHS_FIFO14_POS)) /**< FIFO14_USBHS_FIFO14 Mask */

/**@} end of group USBHS_FIFO14_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_FIFO15 USBHS_FIFO15
 * @brief    Read for OUT data FIFO, write for IN data FIFO.
 * @{
 */
#define MXC_F_USBHS_FIFO15_USBHS_FIFO15_POS            0 /**< FIFO15_USBHS_FIFO15 Position */
#define MXC_F_USBHS_FIFO15_USBHS_FIFO15                ((uint32_t)(0xFFFFFFFFUL << MXC_F_USBHS_FIFO15_USBHS_FIFO15_POS)) /**< FIFO15_USBHS_FIFO15 Mask */

/**@} end of group USBHS_FIFO15_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_HWVERS USBHS_HWVERS
 * @brief    HWVERS
 * @{
 */
#define MXC_F_USBHS_HWVERS_USBHS_HWVERS_POS            0 /**< HWVERS_USBHS_HWVERS Position */
#define MXC_F_USBHS_HWVERS_USBHS_HWVERS                ((uint16_t)(0xFFFFUL << MXC_F_USBHS_HWVERS_USBHS_HWVERS_POS)) /**< HWVERS_USBHS_HWVERS Mask */

/**@} end of group USBHS_HWVERS_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_EPINFO USBHS_EPINFO
 * @brief    Endpoint hardware information.
 * @{
 */
#define MXC_F_USBHS_EPINFO_OUTENDPOINTS_POS            4 /**< EPINFO_OUTENDPOINTS Position */
#define MXC_F_USBHS_EPINFO_OUTENDPOINTS                ((uint8_t)(0xFUL << MXC_F_USBHS_EPINFO_OUTENDPOINTS_POS)) /**< EPINFO_OUTENDPOINTS Mask */

#define MXC_F_USBHS_EPINFO_INTENDPOINTS_POS            0 /**< EPINFO_INTENDPOINTS Position */
#define MXC_F_USBHS_EPINFO_INTENDPOINTS                ((uint8_t)(0xFUL << MXC_F_USBHS_EPINFO_INTENDPOINTS_POS)) /**< EPINFO_INTENDPOINTS Mask */

/**@} end of group USBHS_EPINFO_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_RAMINFO USBHS_RAMINFO
 * @brief    RAM width information.
 * @{
 */
#define MXC_F_USBHS_RAMINFO_RAMBITS_POS                0 /**< RAMINFO_RAMBITS Position */
#define MXC_F_USBHS_RAMINFO_RAMBITS                    ((uint8_t)(0xFUL << MXC_F_USBHS_RAMINFO_RAMBITS_POS)) /**< RAMINFO_RAMBITS Mask */

/**@} end of group USBHS_RAMINFO_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_SOFTRESET USBHS_SOFTRESET
 * @brief    Software reset register.
 * @{
 */
#define MXC_F_USBHS_SOFTRESET_RSTXS_POS                1 /**< SOFTRESET_RSTXS Position */
#define MXC_F_USBHS_SOFTRESET_RSTXS                    ((uint8_t)(0x1UL << MXC_F_USBHS_SOFTRESET_RSTXS_POS)) /**< SOFTRESET_RSTXS Mask */

#define MXC_F_USBHS_SOFTRESET_RSTS_POS                 0 /**< SOFTRESET_RSTS Position */
#define MXC_F_USBHS_SOFTRESET_RSTS                     ((uint8_t)(0x1UL << MXC_F_USBHS_SOFTRESET_RSTS_POS)) /**< SOFTRESET_RSTS Mask */

/**@} end of group USBHS_SOFTRESET_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_CTUCH USBHS_CTUCH
 * @brief    Chirp timeout timer setting.
 * @{
 */
#define MXC_F_USBHS_CTUCH_C_T_UCH_POS                  0 /**< CTUCH_C_T_UCH Position */
#define MXC_F_USBHS_CTUCH_C_T_UCH                      ((uint16_t)(0xFFFFUL << MXC_F_USBHS_CTUCH_C_T_UCH_POS)) /**< CTUCH_C_T_UCH Mask */

/**@} end of group USBHS_CTUCH_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_CTHSRTN USBHS_CTHSRTN
 * @brief    Sets delay between HS resume to UTM normal operating mode.
 * @{
 */
#define MXC_F_USBHS_CTHSRTN_C_T_HSTRN_POS              0 /**< CTHSRTN_C_T_HSTRN Position */
#define MXC_F_USBHS_CTHSRTN_C_T_HSTRN                  ((uint16_t)(0xFFFFUL << MXC_F_USBHS_CTHSRTN_C_T_HSTRN_POS)) /**< CTHSRTN_C_T_HSTRN Mask */

/**@} end of group USBHS_CTHSRTN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_INT USBHS_MXM_INT
 * @brief    USB Added Maxim Interrupt Flag Register.
 * @{
 */
#define MXC_F_USBHS_MXM_INT_VBUS_POS                   0 /**< MXM_INT_VBUS Position */
#define MXC_F_USBHS_MXM_INT_VBUS                       ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_VBUS_POS)) /**< MXM_INT_VBUS Mask */

#define MXC_F_USBHS_MXM_INT_NOVBUS_POS                 1 /**< MXM_INT_NOVBUS Position */
#define MXC_F_USBHS_MXM_INT_NOVBUS                     ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_NOVBUS_POS)) /**< MXM_INT_NOVBUS Mask */

/**@} end of group USBHS_MXM_INT_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_INT_EN USBHS_MXM_INT_EN
 * @brief    USB Added Maxim Interrupt Enable Register.
 * @{
 */
#define MXC_F_USBHS_MXM_INT_EN_VBUS_POS                0 /**< MXM_INT_EN_VBUS Position */
#define MXC_F_USBHS_MXM_INT_EN_VBUS                    ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_EN_VBUS_POS)) /**< MXM_INT_EN_VBUS Mask */

#define MXC_F_USBHS_MXM_INT_EN_NOVBUS_POS              1 /**< MXM_INT_EN_NOVBUS Position */
#define MXC_F_USBHS_MXM_INT_EN_NOVBUS                  ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_INT_EN_NOVBUS_POS)) /**< MXM_INT_EN_NOVBUS Mask */

/**@} end of group USBHS_MXM_INT_EN_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_SUSPEND USBHS_MXM_SUSPEND
 * @brief    USB Added Maxim Suspend Register.
 * @{
 */
#define MXC_F_USBHS_MXM_SUSPEND_SEL_POS                0 /**< MXM_SUSPEND_SEL Position */
#define MXC_F_USBHS_MXM_SUSPEND_SEL                    ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_SUSPEND_SEL_POS)) /**< MXM_SUSPEND_SEL Mask */

/**@} end of group USBHS_MXM_SUSPEND_Register */

/**
 * @ingroup  usbhs_registers
 * @defgroup USBHS_MXM_REG_A4 USBHS_MXM_REG_A4
 * @brief    USB Added Maxim Power Status Register
 * @{
 */
#define MXC_F_USBHS_MXM_REG_A4_VRST_VDDB_N_A_POS       0 /**< MXM_REG_A4_VRST_VDDB_N_A Position */
#define MXC_F_USBHS_MXM_REG_A4_VRST_VDDB_N_A           ((uint32_t)(0x1UL << MXC_F_USBHS_MXM_REG_A4_VRST_VDDB_N_A_POS)) /**< MXM_REG_A4_VRST_VDDB_N_A Mask */

/**@} end of group USBHS_MXM_REG_A4_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_USBHS_REGS_H_
